<template>
  <SportSurvey />
</template>

<script lang="ts">
import { defineComponent } from "vue";
import SportSurvey from "./components/SportSurvey.vue";
export default defineComponent({
  name: "App",
  components: { SportSurvey },
});
</script>

<style>
* {
  font-family: "Montserrat";
}
</style>

<!-- Задача:

Небольшая форма, с опросом:
Опишите ваши любимые спортивные увлечения
На форме построить следующие элементы:
Таблица, в которую добавляются активности
и кнопка "добавить", открывает диалоговое окно, где выбирается активность и несколько параметров:
Селект, со списком:
- горные лыжи
- виндсерфинг
- кайтсерфинг
- сноуборды
- плавание
- яхтинг
- боулинг
- велосипеды
и дополнительные пункты:
сколько лет увлекаешься (цифровое поле)
комментарий (текстовое поле)
для велосипедов дополнительный селект: шоссейные, горные, bmx
и кнопки "добавить" "отменить"

При добавлении (кнопка "добавить" в диалоговом окне), активность попадает в список таблицы, где отображается:
- порядковый номер,
- название активности
и кнопка "удалить"

Кнопка "удалить" убирает активность, и перестраивает порядковые номера.
предпочтительно использовать vuetify -->
